In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('carnames.csv')
df

        Car
0  Mercedes
1    Maruti
2  Mahindra
3  Mercedes
4    Maruti
5  Mahindra

In [3]:
df1=df
df1

        Car
0  Mercedes
1    Maruti
2  Mahindra
3  Mercedes
4    Maruti
5  Mahindra

In [4]:
for index,row in df.iterrows(): # loops over dataframe row by row
    print(row)

Car    Mercedes
Name: 0, dtype: object
Car    Maruti
Name: 1, dtype: object
Car    Mahindra
Name: 2, dtype: object
Car    Mercedes
Name: 3, dtype: object
Car    Maruti
Name: 4, dtype: object
Car    Mahindra
Name: 5, dtype: object

In [5]:
df1

        Car
0  Mercedes
1    Maruti
2  Mahindra
3  Mercedes
4    Maruti
5  Mahindra

In [6]:
c=df1['Car'].value_counts() # counts of unique values in a column
c

Car
Mercedes    2
Maruti      2
Mahindra    2
Name: count, dtype: int64

In [7]:
df1['counts']=df1.groupby('Car').Car.transform('count') #consider it as window function as it keeps all the records
df1

        Car  counts
0  Mercedes       2
1    Maruti       2
2  Mahindra       2
3  Mercedes       2
4    Maruti       2
5  Mahindra       2

In [8]:
visits=df1.groupby('Car').Car.count() # value_count and group by same
visits

Car
Mahindra    2
Maruti      2
Mercedes    2
Name: Car, dtype: int64

In [14]:
df2=pd.DataFrame(c)
df2

          count
Car
Mercedes      2
Maruti        2
Mahindra      2

In [12]:
df2=c.reset_index() # it takes Car column values and make the index
df2

        Car  count
0  Mercedes      2
1    Maruti      2
2  Mahindra      2